// Напишите метод, который принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

int value = 3;
for (int i = 1; i <= value; i++) 
{
Console.WriteLine(i * i * i);
}

//Console.WriteLine(Method);

//void Method(int value);
//int value = 5;
//for (int i = 1; i <= value; i++)
//{
//Console.WriteLine(i * i * i);
//}
